app/views/warehouse_units/operate.html.erb

      <h4><%= f.label :box, class:"label label-info" %></h4>
      <%= f.select :box, WarehouseUnit.pluck(:name),:selected => params[:box],class:"form-control" %>
---
SELECT `warehouse_units`.`name` FROM `warehouse_units`