app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `updated_at`) VALUES ('2016-10-10 20:41:09', '2016-10-10 20:41:09')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `color` = 'Yellow1', `updated_at` = '2016-11-28 21:42:35' WHERE `products`.`id` = 1