app/views/products/index.html.erb


  g.column name: 'Product Name',attribute: 'product_name' do |task|
---
SELECT `products`.* FROM `products`