app/views/products/show.html.erb

SELECT `products`.* FROM `products`
---

  g.column name: 'Product Name',attribute: 'product_name' do |task|